Topics :
----------
merging table
-----------
concat()
merge()
join()

In [179]:
import pandas as pd

data = pd.DataFrame({"ID" : [1,2,3,4] , "Name" : ["Kunal" , "Varad" , "Sanket" , "Rohan"]})
data2 = pd.DataFrame({"ID": [2,6,3,8] , "Score" : [100,200,300,400]})
data3 = pd.DataFrame({"Marks": [100,46,57,78]})

In [181]:
# concat()

In [183]:
res = pd.concat([data , data2] , ignore_index = True)

In [185]:
res

   ID    Name  Score
0   1   Kunal    NaN
1   2   Varad    NaN
2   3  Sanket    NaN
3   4   Rohan    NaN
4   2     NaN  100.0
5   6     NaN  200.0
6   3     NaN  300.0
7   8     NaN  400.0

In [187]:
res = pd.concat([data , data2] ,  axis = 1 , ignore_index = True)
# res = pd.concat([data , data2] ,  axis = 0 , ignore_index = True)

In [188]:
res

   0       1  2    3
0  1   Kunal  2  100
1  2   Varad  6  200
2  3  Sanket  3  300
3  4   Rohan  8  400

In [189]:
res2 = pd.concat([data , data3])

In [190]:
res2

    ID    Name  Marks
0  1.0   Kunal    NaN
1  2.0   Varad    NaN
2  3.0  Sanket    NaN
3  4.0   Rohan    NaN
0  NaN     NaN  100.0
1  NaN     NaN   46.0
2  NaN     NaN   57.0
3  NaN     NaN   78.0

In [191]:
# merge()
# by default it will act as inner join | only matching rows will be taken 
result = pd.merge(data,data2,on = "ID")

In [192]:
result

   ID    Name  Score
0   2   Varad    100
1   3  Sanket    300

In [193]:
result = pd.merge(data,data2,on = "ID" , how="inner")

In [194]:
result

   ID    Name  Score
0   2   Varad    100
1   3  Sanket    300

In [195]:
result = pd.merge(data,data2,on = "ID" , how="outer")

In [196]:
result

   ID    Name  Score
0   1   Kunal    NaN
1   2   Varad  100.0
2   3  Sanket  300.0
3   4   Rohan    NaN
4   6     NaN  200.0
5   8     NaN  400.0

In [197]:
data = pd.DataFrame({"EMP_ID" : [11,12,13,14] , "Name" : ["Kunal" , "Varad" , "Sanket" , "Rohan"]})
data2 = pd.DataFrame({"ID": [2,6,3,8] , "Score" : [100,200,300,400]})
res = pd.merge(data , data2 , left_on = "EMP_ID" ,right_on = "ID" , how = "outer")

In [198]:
res

   EMP_ID    Name   ID  Score
0     NaN     NaN  2.0  100.0
1     NaN     NaN  3.0  300.0
2     NaN     NaN  6.0  200.0
3     NaN     NaN  8.0  400.0
4    11.0   Kunal  NaN    NaN
5    12.0   Varad  NaN    NaN
6    13.0  Sanket  NaN    NaN
7    14.0   Rohan  NaN    NaN

In [199]:
d1 = pd.DataFrame({"SAL" : [1000,2000,4000]} , index = ["x" , "y" , "z"])
d2 = pd.DataFrame({"EMP_ID" : ["A1","B1","C1"]} , index = ["x" , "y" , "z"])

In [200]:
res = pd.merge(d1 , d2 , left_index = True , right_index = True)

In [201]:
res

    SAL EMP_ID
x  1000     A1
y  2000     B1
z  4000     C1

In [202]:
# while working in pandas cross join is not reccomded 
# create two tables with same data
# use suffixes

In [203]:
import pandas as pd

x = pd.DataFrame({"Data": ["PY" , "JAVA", ".NET"], "SAL": [10000, 20000,3000]})
y = pd.DataFrame({"Data": ["PY" , "JAVA", ".NET"], "SAL": [10000, 20000,3000]})

res = pd.merge(x, y, on="Data", suffixes=("_olddata", "_newdata"))

print(res)

   Data  SAL_olddata  SAL_newdata
0    PY        10000        10000
1  JAVA        20000        20000
2  .NET         3000         3000

In [ ]:
#join

In [242]:
res = (data.join(data2 , how = "outer"))
print(res)

   EMP_ID    Name  ID  Score
0      11   Kunal   2    100
1      12   Varad   6    200
2      13  Sanket   3    300
3      14   Rohan   8    400